# Recruiting Analysis

In [1]:
import pandas as pd 
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import pymysql

In [2]:
df = pd.read_csv("C:/Users/Simran/Downloads/recruitment_data.csv")

In [3]:
df.head()

,Applicant ID,Application Date,Application Month,Application_Year,First Name,Last Name,Age,Gender,Date of Birth,Phone Number,...,City,State,Zip Code,Country,Education Level,Years of Experience,Desired Salary,Job Title,Status,Full Name
0,1001,03-06-2023,Jun,2023,Scott,Sheppard,33,Male,31-08-1992,421-429-7655x39421,...,Hollandfort,NV,57588,Micronesia,High School,8,60103.21,Chief Technology Officer,Interviewing,Scott Sheppard
1,1002,15-05-2023,May,2023,Stanley,Lewis,60,Male,29-04-1965,+1-451-574-5308x1681,...,Port Margaretfurt,TN,14726,Greenland,Bachelor's Degree,17,64575.84,"Designer, furniture",Rejected,Stanley Lewis
2,1003,04-08-2023,Aug,2023,Javier,Li,52,Female,10-03-1973,(858)901-5499,...,Dianaland,TX,4699,China,PhD,20,39422.71,"Sound technician, broadcasting/film/video",Rejected,Javier Li
3,1004,28-07-2023,Jul,2023,Christopher,Johnston,24,Other,04-04-2001,(853)681-1839x2010,...,Youngfurt,GA,34455,Ghana,High School,8,51045.11,Air cabin crew,Rejected,Christopher Johnston
4,1005,05-06-2023,Jun,2023,Melissa,Hicks,47,Other,17-06-1978,364-575-8478x67812,...,East Ashleyborough,IN,21014,Solomon Islands,Master's Degree,0,52792.86,Art therapist,Interviewing,Melissa Hicks

In [24]:
df.columns

Index(['Applicant ID', 'Application Date', 'Application Month',
       'Application_Year', 'First Name', 'Last Name', 'Age', 'Gender',
       'Date of Birth', 'Phone Number', 'Email', 'Address', 'City', 'State',
       'Zip Code', 'Country', 'Education Level', 'Years of Experience',
       'Desired Salary', 'Job Title', 'Status', 'Full Name'],
      dtype='object')

In [25]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3000 entries, 0 to 2999
Data columns (total 22 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Applicant ID         3000 non-null   int64
 1   Application Date     3000 non-null   object
 2   Application Month    3000 non-null   object
 3   Application_Year     3000 non-null   int64
 4   First Name           3000 non-null   object
 5   Last Name            3000 non-null   object
 6   Age                  3000 non-null   int64
 7   Gender               3000 non-null   object
 8   Date of Birth        3000 non-null   object
 9   Phone Number         3000 non-null   object
 10  Email                3000 non-null   object
 11  Address              3000 non-null   object
 12  City                 3000 non-null   object
 13  State                3000 non-null   object
 14  Zip Code             3000 non-null   int64
 15  Country              3000 non-null   object
 16  Education Level      3000 non-null   object
 17  Years of Experience  3000 non-null   int64
 18  Desired Salary       3000 non-null   float64
 19  Job Title            3000 non-null   object
 20  Status               3000 non-null   object
 21  Full Name            3000 non-null   object
dtypes: float64(1), int64(5), object(16)
memory usage: 515.8+ KB

In [26]:
df.shape

(3000, 22)

In [27]:
df.dtypes

Applicant ID             int64
Application Date        object
Application Month       object
Application_Year         int64
First Name              object
Last Name               object
Age                      int64
Gender                  object
Date of Birth           object
Phone Number            object
Email                   object
Address                 object
City                    object
State                   object
Zip Code                 int64
Country                 object
Education Level         object
Years of Experience      int64
Desired Salary         float64
Job Title               object
Status                  object
Full Name               object
dtype: object

In [28]:
df.isnull().sum()

Applicant ID           0
Application Date       0
Application Month      0
Application_Year       0
First Name             0
Last Name              0
Age                    0
Gender                 0
Date of Birth          0
Phone Number           0
Email                  0
Address                0
City                   0
State                  0
Zip Code               0
Country                0
Education Level        0
Years of Experience    0
Desired Salary         0
Job Title              0
Status                 0
Full Name              0
dtype: int64

## Data Tranforming

In [7]:
df["Date of Birth"] = pd.to_datetime(df["Date of Birth"], errors= "coerce",dayfirst=True)

In [8]:
df.dtypes

Applicant ID                    int64
Application Date               object
Application Month              object
Application_Year                int64
First Name                     object
Last Name                      object
Age                             int64
Gender                         object
Date of Birth          datetime64[ns]
Phone Number                   object
Email                          object
Address                        object
City                           object
State                          object
Zip Code                        int64
Country                        object
Education Level                object
Years of Experience             int64
Desired Salary                float64
Job Title                      object
Status                         object
Full Name                      object
dtype: object

In [9]:
df["Full Name"] = df["First Name"] + " " + df["Last Name"]

In [10]:
df["Full Name"].head()

0          Scott Sheppard
1           Stanley Lewis
2               Javier Li
3    Christopher Johnston
4           Melissa Hicks
Name: Full Name, dtype: object

In [11]:
df.duplicated().sum()

np.int64(0)

##  Save the file

In [12]:
df.to_csv("C:/Users/Simran/Downloads/recruitment_data.csv",index = False)

### connecting python file to Mysql Database

In [13]:
try:
    connection = pymysql.connect(
        host = "localhost",
        user = "root",
        password = "kimtaehyung@1995"
    )
    print("Connected to MySQL Successfully!")
except Exception as e:
    print("Error: ",e)

Connected to MySQL Successfully!

In [14]:
cursor = connection.cursor()

cursor.execute("CREATE DATABASE IF NOT EXISTS recruitment_db")
print("Database created successfuly!")

Database created successfuly!

In [15]:
cursor.execute("USE recruitment_db")
print("Database Selected!")

Database Selected!

In [16]:
# cursor.execute("""
# CREATE TABLE IF NOT EXISTS recruitment_data (
#     `Applicant ID` INT PRIMARY KEY,
#     `Application Date` VARCHAR(30),
#     `Application Month` VARCHAR(10),
#     `Appication Year` INT,
#     `First Name` VARCHAR(30),
#     `Last Name` VARCHAR(30),
#     Age INT,
#     Gender VARCHAR(15),
#     `Date of Birth` DATE,
#     `Phone Number` VARCHAR(50),
#     Email VARCHAR(50),
#     Address VARCHAR(100),
#     City VARCHAR(50),
#     State VARCHAR(50),
#     `Zip Code` INT,
#     Country VARCHAR(50),
#     `Education Level` VARCHAR(50),
#     `Years of Experience` INT,
#     `esired Salary` DECIMAL(10,2),
#     `Job Title` VARCHAR(100),
#     Status VARCHAR(50),
#     `Full Name` VARCHAR(50)
# );
# """)

# print("Table Created Successfully!")

In [40]:
# for index, row in df.iterrows():
#     sql = """
#     INSERT INTO recruitment_data (
#         `Applicant ID`, `Application Date`, `Application Month`, `Application Year`,
#         `First Name`, `Last Name`, Age, Gender, `Date of Birth`, `Phone Number`,
#         Email, Address, City, State, `Zip Code`, Country, `Education Level`,
#         `Years of Experience`, `Desired Salary`, `Job Title`, Status, `Full Name`
#     ) VALUES (%s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s)
#     """

#     cursor.execute(sql, tuple(row))
    
# conn.commit()
# print("Data inserted successfully!")

In [24]:
# cursor.execute("DROP TABLE recruitment_data;")
    
# connection.commit()

In [21]:
cursor.execute("""
CREATE TABLE IF NOT EXISTS recruitment_data (
    `Applicant ID` INT PRIMARY KEY,
    `Application Date` VARCHAR(30),
    `Application Month` VARCHAR(10),
    `Application Year` INT,
    `First Name` VARCHAR(30),
    `Last Name` VARCHAR(30),
    Age INT,
    Gender VARCHAR(15),
    `Date of Birth` DATE,
    `Phone Number` VARCHAR(50),
    Email VARCHAR(50),
    Address VARCHAR(100),
    City VARCHAR(50),
    State VARCHAR(50),
    `Zip Code` INT,
    Country VARCHAR(100),
    `Education Level` VARCHAR(50),
    `Years of Experience` INT,
    `Desired Salary` DECIMAL(10,2),
    `Job Title` VARCHAR(100),
    Status VARCHAR(50),
    `Full Name` VARCHAR(50)
);
""")

print("Table Created Successfully!")

Table Created Successfully!

In [22]:
for index, row in df.iterrows():
    sql = """
    INSERT INTO recruitment_data (
        `Applicant ID`, `Application Date`, `Application Month`, `Application Year`,
        `First Name`, `Last Name`, Age, Gender, `Date of Birth`, `Phone Number`,
        Email, Address, City, State, `Zip Code`, Country, `Education Level`,
        `Years of Experience`, `Desired Salary`, `Job Title`, Status, `Full Name`
    ) VALUES (%s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s)
    """
    cursor.execute(sql, tuple(row))
connection.commit()
print("Data inserted successfully!")

Data inserted successfully!

In [23]:
cursor = connection.cursor()
cursor.execute("DESCRIBE recruitment_data;")
for row in cursor.fetchall():
    print(row)

('Applicant ID', 'int', 'NO', 'PRI', None, '')
('Application Date', 'varchar(30)', 'YES', '', None, '')
('Application Month', 'varchar(10)', 'YES', '', None, '')
('Application Year', 'int', 'YES', '', None, '')
('First Name', 'varchar(30)', 'YES', '', None, '')
('Last Name', 'varchar(30)', 'YES', '', None, '')
('Age', 'int', 'YES', '', None, '')
('Gender', 'varchar(15)', 'YES', '', None, '')
('Date of Birth', 'date', 'YES', '', None, '')
('Phone Number', 'varchar(50)', 'YES', '', None, '')
('Email', 'varchar(50)', 'YES', '', None, '')
('Address', 'varchar(100)', 'YES', '', None, '')
('City', 'varchar(50)', 'YES', '', None, '')
('State', 'varchar(50)', 'YES', '', None, '')
('Zip Code', 'int', 'YES', '', None, '')
('Country', 'varchar(100)', 'YES', '', None, '')
('Education Level', 'varchar(50)', 'YES', '', None, '')
('Years of Experience', 'int', 'YES', '', None, '')
('Desired Salary', 'decimal(10,2)', 'YES', '', None, '')
('Job Title', 'varchar(100)', 'YES', '', None, '')
('Status', 'varchar(50)', 'YES', '', None, '')
('Full Name', 'varchar(50)', 'YES', '', None, '')